обновить версию PHP, прописать типы результатам функций, аргументам функций, пропертям классов
писать зеленую доку для шторма перед каждым fetch

если с картинкой ошибки, все равно запись в базу добавляется (на бонлибро)?
при выводе на карточку товара обрамлять все данные из базы в htmlspecialchars
на бонлибро book-form.php надо переложить в папку include?
на бонлибро все связи по foreign keys заменить с cascade на restrict, предварительно сделав дамп базы.
потом попробовать удалять участвующие в связях столбцы в админке и посмотреть, что получится

- в админке ошибки у ClassiсEditor
- warnings в консоли из-за отсутствия файлов map

