начать заполнять таблицу товаров
использовать уже сделанную таблицу брендов
если при добавлении нового товара такого бренда еще нет, то добавлять по ходу в таблицу брендов
если бренды для М и Ж повторяются, описание брать какое-то одно
обновить версию PHP, прописать типы всем функциям, переменным, агрументам и т.д.

на бонлибро ошибка, когда удаляешь картинку
если с картинкой ошибки, все равно запись в базу добавляется (на бонлибро)?
при выводе на карточку товара обрамлять все данные из базы в htmlspecialchars
а textarea также снаружи в nl2br(чтобы переносы строк в textarea перевести в br)

перепроверить в edit, чтобы все работало
добавить удаление картинки

